In [11]:
import pandas as pd
a=pd.read_csv("test.csv")
print(a)
a.sort_values(by=["height"], ascending=True)

       name  roll no  height
0     rahul       50     165
1  sidharth       34     170
2   fathima       36     160
3      tony       80     167

       name  roll no  height
2   fathima       36     160
0     rahul       50     165
3      tony       80     167
1  sidharth       34     170